CyRunners Ambassador Program – Implementation Plan

Objective
To identify, onboard, and activate 20 high-quality Ambassadors (“CyRunners”) to represent Cysic globally, amplify the ComputeFi narrative, and expand community reach through authentic content, relationships, and local engagement.
The rollout will happen in three structured waves — starting from the internal community, expanding to key opinion leaders (KOLs), and concluding with an open public round.

Phase 1: Internal Community Recruitment
Timeline: October 23 
Goal: Select 5–10 early community members to form the core CyRunners cohort.
Steps:
Announce the launch of the CyRunners Program on Discord and Telegram.


Share the application form link and encourage community members to apply.


Select 5–10 qualified applicants based on engagement, content ability, and community presence.


Offer each selected Ambassador a $500 monthly reward, starting this week (October 10).


Provide onboarding materials: brand guidelines, mission brief, and task schedule.


Purpose:
Reward and empower loyal community members.


Create an internal narrative loop to generate early excitement and organic content.


Phase 2: KOL Onboarding
Timeline: October 24 – October 31
Goal: Onboard 5 high-reach KOLs who align with Cysic’s mission and help amplify ComputeFi to broader audiences.
Steps:
Identify 10–15 aligned KOLs (technical, narrative, and meme-native).


Reach out directly with personalized invites to join the CyRunners program.


Offer flexible compensation depending on their audience reach:


Base: $500/month


Optional: token allocations or performance bonuses (TBD).


Integrate them into the CyRunners structure — same guidelines, access to internal materials, and monthly syncs.


Purpose:
Leverage KOL credibility to push Cysic narratives to new audiences.


Blend organic community energy with top-down influence.


Phase 3: Public Wave
Timeline: October 31 – November 7
Goal: Open applications publicly via X and select the final 10 ambassadors.
Steps:
Announce the CyRunners program publicly on X with a thread and creative video.


Direct users to the application form (Google Form or Typeform).


Screen applications based on quality, activity, and audience relevance.


Select 10 final ambassadors and onboard them with the existing cohort.


Start their $500/month rewards from November 7 onward.


Purpose:
Expand the CyRunners program globally and diversify representation.


Create continuous social momentum around the program and ComputeFi narrative.


Final Cohort
Total Ambassadors: 20 (10 Community + 5 KOLs + 5 Public)


Total Monthly Cost: $10,000


Deliverables:


Weekly content tasks (threads, memes, videos, explainers).


Community engagement and sentiment reporting.


Local event participation or activation support (as applicable).


Expected Outcomes
Establish the first wave of human nodes spreading Cysic’s Proof of Compute narrative.


Consistent content flow reinforcing the ComputeFi positioning across X, Discord, and IRL events.


Increased mindshare, credibility, and community expansion leading up to Mainnet and future campaigns.



